#include <gic.h>
#include <gic_regs.h>
#include <vdev.h>
#include <asm-arm_inline.h>

#define DEBUG
#include <log/print.h>

#define VGICD_ITLINESNUM    128
/* Lines:128, CPU:0, Security Extenstin:No */
#define VGICD_TYPER_DEFAULT ((VGICD_ITLINESNUM >> 5) - 1)
#define VGICD_IIDR_DEFAULT  (0x43B) /* Cortex-A15 */
#define VGICD_NUM_IGROUPR   (VGICD_ITLINESNUM/32)
#define VGICD_NUM_IENABLER  (VGICD_ITLINESNUM/32)
#define VGICD_NUM_ICSENABLER 10
//#define VGICD_NUM_ISENABLER 5
//#define VGICE_NUM_ICENABLER 5

/* return the bit position of the first bit set from msb
 * for example, firstbit32(0x7F = 111 1111) returns 7
 */
#define firstbit32(word) (31 - asm_clz(word))
#define NUM_MAX_VIRQS   128
#define NUM_STATUS_WORDS    (NUM_MAX_VIRQS / 32)

/*
 1. High Priority Registers to be implemented first for test with linux
 2. access size support: 8/16/32bit
 3. notifying enable status changed interrupts to outside
 4. API for interrupt enable status change callback registeration
 */

/* Virtual GIC Distributor */
/* Priority of implementation
 - [V] CTLR, TYPER
 - [V] ICFGR
 - [V] ITARGETSR
 - [V] IPRIORITYR
 - [V] ISCENABLER
 -----------------------
 - [ ]
 */
//struct gicd_regs {
//	uint32_t CTLR; /*0x000 RW*/
//	uint32_t TYPER; /*      RO*/
//	uint32_t IIDR; /*      RO*/
//
//	uint32_t IGROUPR[VGICD_NUM_IGROUPR]; /* 0x080 */
//	uint32_t ISCENABLER[VGICD_NUM_ICSENABLER]; /* 0x100, ISENABLER/ICENABLER */
//
////    uint32_t ISENABLER[VGICE_NUM_ISENABLER];    /* 0x100, ISENABLER */
////    uint32_t ICENABLER[VGICE_NUM_ICENABLER];    /* 0x100, ICENABLER */
////    uint32_t ISCENABLER[10];
//	uint32_t ISPENDR[32]; /* 0x200, ISPENDR/ICPENDR */
//	uint32_t ISACTIVER[32]; /* 0x300, ISACTIVER/ICACTIVER */
//	uint32_t IPRIORITYR[128]; /* 0x400 */
//	uint32_t ITARGETSR[128]; /* 0x800 [0]: RO, Otherwise, RW */
//	uint32_t ICFGR[64]; /* 0xC00 */
//
//	/* Cortex-A15 */
//	/* 0xD00 GICD_PPISR RO */
//	/* 0xD04 ~ 0xD1C GICD_SPISRn RO */
//
//	uint32_t NSACR[64]; /* 0xE00 */
//	uint32_t SGIR; /* 0xF00 WO */
//	uint32_t CPENDSGIR[4]; /* 0xF10 CPENDSGIR 0xF20 SPENDGIR */
//
///* 0xFD0 ~ 0xFFC RO Cortex-A15 PIDRn, CIDRn */
//};
#define VGICE_NUM_ISPENDR 5
#define VGICE_NUM_ICPENDR 5
#define VGICE_NUM_ISENABLER 5
#define VGICE_NUM_ICENABLER 5
#define VGICE_NUM_ISACTIVER 5
#define VGICE_NUM_ICACTIVER 5
#define VGICE_NUM_IPRIORITYR 40
#define VGICE_NUM_ITARGETSR 40
#define VGICE_NUM_ICFGR 10
#define VGICE_NUM_SPISR 4
#define VGICE_NUM_CPENDSGIR 4
#define VGICE_NUM_SPENDSGIR 4

struct gicd_regs
{
				uint32_t CTLR; /*0x000 RW*/
				uint32_t TYPER; /*      RO*/
				uint32_t IIDR; /*      RO*/

				uint32_t IGROUPR[VGICD_NUM_IGROUPR]; /* 0x080 */
//	uint32_t ISCENABLER[VGICD_NUM_ICSENABLER]; /* 0x100, ISENABLER/ICENABLER */

				uint32_t ISENABLER[VGICE_NUM_ISENABLER]; /* 0x100, ISENABLER */
				uint32_t ICENABLER[VGICE_NUM_ICENABLER]; /* 0x180, ICENABLER */
//    uint32_t ISCENABLER[5];
//	uint32_t ISPENDR[32]; /* 0x200, ISPENDR/ICPENDR */

				uint32_t ISPENDR[VGICE_NUM_ISPENDR];
				uint32_t ICPENDR[VGICE_NUM_ICPENDR];

//    uint32_t ISACTIVER[32]; /* 0x300, ISACTIVER/ICACTIVER */

				uint32_t ISACTIVER[VGICE_NUM_ISACTIVER];
				uint32_t ICACTIVER[VGICE_NUM_ICACTIVER];

				uint32_t IPRIORITYR[VGICE_NUM_IPRIORITYR]; /* 0x400 */

				uint32_t ITARGETSR[VGICE_NUM_ITARGETSR]; /* 0x800 [0]: RO, Otherwise, RW */

				uint32_t ICFGR[VGICE_NUM_ICFGR]; /* 0xC00 */

				/* Cortex-A15 */
				/* 0xD00 GICD_PPISR RO */
				/* 0xD04 ~ 0xD1C GICD_SPISRn RO */
				uint32_t PPISR; /* 0xD00 */
				uint32_t SPISR[VGICE_NUM_SPISR]; /* 0xD04 ~ D10 */
				uint32_t SGIR; /* 0xF00 WO */
				uint32_t CPENDSGIR[VGICE_NUM_CPENDSGIR]; /* 0x0F10 */
				uint32_t SPENDSGIR[VGICE_NUM_SPENDSGIR]; /* 0x0F20 */

//uint32_t NSACR[64]; /* 0xE00 */

//uint32_t CPENDSGIR[4]; /* 0xF10 CPENDSGIR 0xF20 SPENDGIR */

/* 0xFD0 ~ 0xFFC RO Cortex-A15 PIDRn, CIDRn */
};

struct gicd_handler_entry
{
				uint32_t offset;
				vdev_callback_t handler;
};

static hvmm_status_t
handler_000 (uint32_t write, uint32_t offset, uint32_t *pvalue,
													enum vdev_access_size access_size);
static hvmm_status_t
handler_ISCENABLER (uint32_t write, uint32_t offset, uint32_t *pvalue,
																				enum vdev_access_size access_size);
static hvmm_status_t
handler_ISCPENDR (uint32_t write, uint32_t offset, uint32_t *pvalue,
																		enum vdev_access_size access_size);
static hvmm_status_t
handler_ISCACTIVER (uint32_t write, uint32_t offset, uint32_t *pvalue,
																				enum vdev_access_size access_size);
static hvmm_status_t
handler_IPRIORITYR (uint32_t write, uint32_t offset, uint32_t *pvalue,
